benvonhandorf/sc/scr/nrf5SDK/scr_nrf/main.cpp
#define SCHED_MAX_EVENT_DATA_SIZE APP_TIMER_SCHED_EVENT_DATA_SIZE /**< Maximum size of scheduler events. */
#ifdef SVCALL_AS_NORMAL_FUNCTION
#define SCHED_QUEUE_SIZE 20 /**< Maximum number of events in the scheduler queue. More is needed in case of Serialization. */
#else
#define SCHED_QUEUE_SIZE 20 /**< Maximum number of events in the scheduler queue. */
#endif

#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define APP_ADV_FAST_INTERVAL 0x0028 /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 25 ms.). */
#define APP_ADV_SLOW_INTERVAL 0x00A0 /**< Slow advertising interval (in units of 0.625 ms. This value corresponds to 100 ms.). */

#define APP_ADV_FAST_DURATION 3000  /**< The advertising duration of fast advertising in units of 10 milliseconds. */
#define APP_ADV_SLOW_DURATION 18000 /**< The advertising duration of slow advertising in units of 10 milliseconds. */

static StatusIndicator statusIndicator;

APP_TIMER_DEF(m_battery_timer_id); /**< Battery timer. */
BLE_BAS_DEF(m_bas);                /**< Battery service instance. */
BLE_HIDS_DEF(m_hids,               /**< HID service instance. */
    NRF_SDH_BLE_TOTAL_LINK_COUNT,
    INPUT_REP_BUTTONS_LEN,
    INPUT_REP_MOVEMENT_LEN,
    INPUT_REP_MEDIA_PLAYER_LEN);
NRF_BLE_GATT_DEF(m_gatt);           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising); /**< Advertising module instance. */

#define IDLE_POLL_INTERVAL APP_TIMER_TICKS(20) /**< Battery level measurement interval (ticks). */

APP_TIMER_DEF(m_poll_timer); /**< Poll from idle timer. */

static bool m_in_boot_mode = false;                      /**< Current protocol mode. */
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static pm_peer_id_t m_peer_id;                           /**< Device reference handle to the current bonded central. */
static ble_uuid_t m_adv_uuids[] =                        /**< Universally unique service identifiers. */
    {
        {BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};

#if SWIFT_PAIR_SUPPORTED == 1
static uint8_t m_sp_payload[] = /**< Payload of advertising data structure for Microsoft Swift Pair feature. */
    {
        MICROSOFT_BEACON_ID,
        MICROSOFT_BEACON_SUB_SCENARIO,
        RESERVED_RSSI_BYTE};
static ble_advdata_manuf_data_t m_sp_manuf_advdata = /**< Advertising data structure for Microsoft Swift Pair feature. */
    {
        .company_identifier = MICROSOFT_VENDOR_ID,
        .data =
            {
                .size = sizeof(m_sp_payload),
                .p_data = &m_sp_payload[0]}};
static ble_advdata_t m_sp_advdata;
#endif

BatteryAdc *batteryAdc = NULL;

static void on_hids_evt(ble_hids_t *p_hids, ble_hids_evt_t *p_evt);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip) {
  pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
  uint32_t peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

  ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
  APP_ERROR_CHECK(err_code);

  NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
      peer_id_count + 1,
      BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

  err_code = pm_whitelist_set(peer_ids, peer_id_count);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip) {
  NRF_LOG_INFO("identities_set");

  pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
  uint32_t peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

  ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
  APP_ERROR_CHECK(err_code);

  err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
  APP_ERROR_CHECK(err_code);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void) {
  ret_code_t err_code;

  NRF_LOG_INFO("Erase bonds!");

  err_code = pm_peers_delete();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds) {
  if (erase_bonds == true) {
    delete_bonds();
    // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
  } else {
    whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

    ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(ret);
  }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const *p_evt) {
  pm_handler_on_pm_evt(p_evt);
  pm_handler_flash_clean(p_evt);

  switch (p_evt->evt_id) {
  case PM_EVT_PEERS_DELETE_SUCCEEDED:
    advertising_start(false);
    break;

  case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
    if (p_evt->params.peer_data_update_succeeded.flash_changed && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING)) {
      NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible");
      // Note: You should check on what kind of white list policy your application should use.

      whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
    }
    break;

  default:
    break;
  }
}

/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error) {
  APP_ERROR_HANDLER(nrf_error);
}

