benvonhandorf/sc/scr/nrf5SDK/scr_nrf/main.cpp
/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error) {
  APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for performing a battery measurement, and update the Battery Level characteristic in the Battery Service.
 */
static void battery_level_update(uint8_t battery_percentage) {
  ret_code_t err_code;

  NRF_LOG_INFO("Battery level: %d", battery_percentage);

  err_code = ble_bas_battery_level_update(&m_bas, battery_percentage, BLE_CONN_HANDLE_ALL);

  if ((err_code != NRF_SUCCESS) &&
      (err_code != NRF_ERROR_BUSY) &&
      (err_code != NRF_ERROR_RESOURCES) &&
      (err_code != NRF_ERROR_FORBIDDEN) &&
      (err_code != NRF_ERROR_INVALID_STATE) &&
      (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
    APP_ERROR_HANDLER(err_code);
  }
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void *p_context) {
  UNUSED_PARAMETER(p_context);
  NRF_LOG_INFO("Requesting battery update");
  if(batteryAdc != NULL) {
    batteryAdc->sample();
  }
}

//static void poll_from_idle_handler(void *p_context) {
//  SPITrackball *trackball = (SPITrackball *) p_context;
//
//  trackball->Poll();
//}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void) {
  ret_code_t err_code;

  err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

  // Create battery timer.
  err_code = app_timer_create(&m_battery_timer_id,
      APP_TIMER_MODE_REPEATED,
      battery_level_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);

//    err_code = app_timer_create(&m_poll_timer,
//      APP_TIMER_MODE_SINGLE_SHOT,
//      poll_from_idle_handler);
//  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void) {
  ret_code_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
      (const uint8_t *)DEVICE_NAME,
      strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_MOUSE);
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void) {
  ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error) {
  APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Queued Write Module.
 */
static void qwr_init(void) {
  ret_code_t err_code;
  nrf_ble_qwr_init_t qwr_init_obj = {0};

  qwr_init_obj.error_handler = nrf_qwr_error_handler;

  err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init_obj);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Device Information Service.
 */
static void dis_init(void) {
  ret_code_t err_code;
  ble_dis_init_t dis_init_obj;
  ble_dis_pnp_id_t pnp_id;

  pnp_id.vendor_id_source = PNP_ID_VENDOR_ID_SOURCE;
  pnp_id.vendor_id = PNP_ID_VENDOR_ID;
  pnp_id.product_id = PNP_ID_PRODUCT_ID;
  pnp_id.product_version = PNP_ID_PRODUCT_VERSION;

  memset(&dis_init_obj, 0, sizeof(dis_init_obj));

  ble_srv_ascii_to_utf8(&dis_init_obj.manufact_name_str, MANUFACTURER_NAME);
  dis_init_obj.p_pnp_id = &pnp_id;

  dis_init_obj.dis_char_rd_sec = SEC_JUST_WORKS;

  err_code = ble_dis_init(&dis_init_obj);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Battery Service.
 */
static void bas_init(void) {
  ret_code_t err_code;
  ble_bas_init_t bas_init_obj;

  memset(&bas_init_obj, 0, sizeof(bas_init_obj));

  bas_init_obj.evt_handler = NULL;
  bas_init_obj.support_notification = true;
  bas_init_obj.p_report_ref = NULL;
  bas_init_obj.initial_batt_level = 100;

  bas_init_obj.bl_rd_sec = SEC_JUST_WORKS;
  bas_init_obj.bl_cccd_wr_sec = SEC_JUST_WORKS;
  bas_init_obj.bl_report_rd_sec = SEC_JUST_WORKS;

  err_code = ble_bas_init(&m_bas, &bas_init_obj);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing HID Service.
 */
static void hids_init(void) {
  ret_code_t err_code;
  ble_hids_init_t hids_init_obj;
  ble_hids_inp_rep_init_t *p_input_report;
  uint8_t hid_info_flags;

  static ble_hids_inp_rep_init_t inp_rep_array[INPUT_REPORT_COUNT];
  static uint8_t rep_map_data[] =
      {
          0x05, 0x01, // Usage Page (Generic Desktop)
          0x09, 0x02, // Usage (Mouse)

          0xA1, 0x01, // Collection (Application)

          // Report ID 1: Mouse buttons + scroll/pan
          0x85, 0x01,       // Report Id 1
          0x09, 0x01,       // Usage (Pointer)
          0xA1, 0x00,       // Collection (Physical)
          0x95, 0x05,       // Report Count (3)
          0x75, 0x01,       // Report Size (1)
          0x05, 0x09,       // Usage Page (Buttons)
          0x19, 0x01,       // Usage Minimum (01)
          0x29, 0x05,       // Usage Maximum (05)
          0x15, 0x00,       // Logical Minimum (0)
          0x25, 0x01,       // Logical Maximum (1)
          0x81, 0x02,       // Input (Data, Variable, Absolute)
          0x95, 0x01,       // Report Count (1)
          0x75, 0x03,       // Report Size (3)
          0x81, 0x01,       // Input (Constant) for padding
          0x75, 0x08,       // Report Size (8)
          0x95, 0x01,       // Report Count (1)
          0x05, 0x01,       // Usage Page (Generic Desktop)
          0x09, 0x38,       // Usage (Wheel)
          0x15, 0x81,       // Logical Minimum (-127)
          0x25, 0x7F,       // Logical Maximum (127)
          0x81, 0x06,       // Input (Data, Variable, Relative)
          0x05, 0x0C,       // Usage Page (Consumer)
          0x0A, 0x38, 0x02, // Usage (AC Pan)
          0x95, 0x01,       // Report Count (1)
          0x81, 0x06,       // Input (Data,Value,Relative,Bit Field)
          0xC0,             // End Collection (Physical)

