benvonhandorf/sc/scr/nrf5SDK/scr_nrf/main.cpp
  memset(&init, 0, sizeof(init));

  adv_flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
  init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
  init.advdata.include_appearance = true;
  init.advdata.flags = adv_flags;
  init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  init.advdata.uuids_complete.p_uuids = m_adv_uuids;
#if SWIFT_PAIR_SUPPORTED == 1
  init.advdata.p_manuf_specific_data = &m_sp_manuf_advdata;
  memcpy(&m_sp_advdata, &init.advdata, sizeof(m_sp_advdata));
#endif

  init.config.ble_adv_whitelist_enabled = true;
  init.config.ble_adv_directed_high_duty_enabled = true;
  init.config.ble_adv_directed_enabled = false;
  init.config.ble_adv_directed_interval = 0;
  init.config.ble_adv_directed_timeout = 0;
  init.config.ble_adv_fast_enabled = true;
  init.config.ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
  init.config.ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
  init.config.ble_adv_slow_enabled = true;
  init.config.ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
  init.config.ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;

  init.evt_handler = on_adv_evt;
  init.error_handler = ble_advertising_error_handler;

  err_code = ble_advertising_init(&m_advertising, &init);
  APP_ERROR_CHECK(err_code);

  ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void) {
  APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function for sending a Mouse Movement.
 *
 * @param[in]   x_delta   Horizontal movement.
 * @param[in]   y_delta   Vertical movement.
 */
static void boot_mouse_send(int16_t x_delta, int16_t y_delta, uint8_t leftClick, uint8_t middleClick, uint8_t rightClick) {
  ret_code_t err_code;

  if (m_in_boot_mode) {
    x_delta = MIN(x_delta, 0x00ff);
    y_delta = MIN(y_delta, 0x00ff);

    uint8_t buttons = 0 |
                leftClick << 0 |
                rightClick << 1 |
                middleClick << 2;

    err_code = ble_hids_boot_mouse_inp_rep_send(&m_hids,
        buttons,
        (int8_t)x_delta,
        (int8_t)y_delta,
        0,
        NULL,
        m_conn_handle);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != NRF_ERROR_BUSY) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING) &&
        (err_code != NRF_ERROR_FORBIDDEN)) {
      APP_ERROR_HANDLER(err_code);
    }
  }
}
   
static void mouse_movement_send(int16_t x_delta, int16_t y_delta) {
  ret_code_t err_code;

  if (m_in_boot_mode) {
    return ;
  }
  
  uint8_t buffer[INPUT_REP_MOVEMENT_LEN];

  APP_ERROR_CHECK_BOOL(INPUT_REP_MOVEMENT_LEN == 3);

  x_delta = MIN(x_delta, 0x0fff);
  y_delta = MIN(y_delta, 0x0fff);

  buffer[0] = x_delta & 0x00ff;
  buffer[1] = ((y_delta & 0x000f) << 4) | ((x_delta & 0x0f00) >> 8);
  buffer[2] = (y_delta & 0x0ff0) >> 4;

  err_code = ble_hids_inp_rep_send(&m_hids,
      INPUT_REP_MOVEMENT_INDEX,
      INPUT_REP_MOVEMENT_LEN,
      buffer,
      m_conn_handle);

  if ((err_code != NRF_SUCCESS) &&
      (err_code != NRF_ERROR_INVALID_STATE) &&
      (err_code != NRF_ERROR_RESOURCES) &&
      (err_code != NRF_ERROR_BUSY) &&
      (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING) &&
      (err_code != NRF_ERROR_FORBIDDEN)) {
    APP_ERROR_HANDLER(err_code);
  }
}

static void mouse_button_send( uint8_t leftClick, uint8_t middleClick, uint8_t rightClick) {
  ret_code_t err_code;

  if (m_in_boot_mode) {
    return ;
  }
  
  uint8_t buffer[1];

  APP_ERROR_CHECK_BOOL(INPUT_REP_BUTTONS_LEN == 3);

  uint8_t buttons = 0 |
        leftClick << 0 |
        rightClick << 1 |
        middleClick << 2;

  err_code = ble_hids_inp_rep_send(&m_hids,
      INPUT_REP_BUTTONS_INDEX,
      1,
      &buttons,
      m_conn_handle);

  if ((err_code != NRF_SUCCESS) &&
      (err_code != NRF_ERROR_INVALID_STATE) &&
      (err_code != NRF_ERROR_RESOURCES) &&
      (err_code != NRF_ERROR_BUSY) &&
      (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING) &&
      (err_code != NRF_ERROR_FORBIDDEN)) {
    APP_ERROR_HANDLER(err_code);
  }
}

/**@brief Timer value function that handles wrap around on the app timer.  Assumes
method will be called at least once during each RTC wraparound interval.
*/
uint32_t get_timer_compensated() {
  static uint32_t lastTimer = 0UL;
  static uint32_t offset = 0UL;

  uint32_t newValue = app_timer_cnt_get();

  if(newValue < lastTimer) {
    offset += APP_TIMER_MAX_CNT_VAL + 1;
  }

  lastTimer = newValue;

  return newValue + offset;
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void) {
  ret_code_t err_code = NRF_LOG_INIT(&get_timer_compensated);
  APP_ERROR_CHECK(err_code);

  NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
  ret_code_t err_code;
  err_code = nrf_pwr_mgmt_init();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void) {
  app_sched_execute();
  if (NRF_LOG_PROCESS() == false) {
    nrf_pwr_mgmt_run();
  }
}

nrfx_wdt_channel_id wdt_channel_id;

void wdt_event_handler(void) {
  //Watchdog has expired.  We get 2 32k/s oscillator cycles to wrap things up before reset
  NRF_LOG_ERROR("Watchdog");
  NRF_LOG_FLUSH();
}

/**@brief Function for application main entry.
 */
int main(void) {
  ret_code_t err_code;
  bool erase_bonds = false;

  // Initialize.
  log_init();
  timers_init();

  nrf_delay_ms(2000);

  statusIndicator.initialize();

  //Configure WDT.
  nrfx_wdt_config_t config = NRFX_WDT_DEAFULT_CONFIG;
  err_code = nrfx_wdt_init(&config, wdt_event_handler);
  APP_ERROR_CHECK(err_code);
  err_code = nrfx_wdt_channel_alloc(&wdt_channel_id);
  APP_ERROR_CHECK(err_code);
  nrfx_wdt_enable();

