benvonhandorf/sc/scr/nrf5SDK/scr_nrf/main.cpp
#ifdef UART_GND
  //Pin 3 used as a GND for a pin 2 logging UART
  nrf_gpio_cfg_output(UART_GND);
  nrf_gpio_pin_clear(UART_GND);
#endif

  LatchingButton *left = new LatchingButton(BUTTON_2, get_timer_compensated);

  LatchingButton *right = new LatchingButton(BUTTON_1, get_timer_compensated);


  if(left->rawValue() && right->rawValue()) {
    NRF_LOG_INFO("Buttons clicked on boot - erasing bonds");
    erase_bonds = true;
  }

  Pointer *trackball = new PimoroniTrackball(TWI_SCL, TWI_SDA, TRACKBALL_INTERRUPT);

  power_management_init();
  ble_stack_init();
  scheduler_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
  peer_manager_init();

  batteryAdc = new BatteryAdc(BATTERY_ADC_CHANNEL, battery_level_update);

  // Start execution.
  NRF_LOG_INFO("Initialization complete.");
  timers_start();
  advertising_start(erase_bonds);

  trackball->Initialize();

  // Enter main loop.
  while (true) {
    nrfx_wdt_feed();

    if(!trackball->isInitialized()) {
      statusIndicator.initializationComplete();
    } else {
    }

    if (trackball->isBusy()) {
      app_sched_execute();
    } else {
      if (trackball->hasData()) {
        int8_t deltaX = trackball->getX();
        int8_t deltaY = trackball->getY();
        
        bool leftDirty = left->isDirty();
        bool rightDirty = right->isDirty();
        bool buttonsDirty = leftDirty || rightDirty ;

        if(m_in_boot_mode) {
          if (deltaX != 0 || deltaY != 0 || buttonsDirty) {
            uint8_t leftButtonValue = left->isPressed();
            uint8_t rightButtonValue = right->isPressed();

            boot_mouse_send(deltaX, deltaY, leftButtonValue, 0, rightButtonValue);

            NRF_LOG_INFO("Boot mode send: %d, %d - %d:%d", deltaX, deltaY, leftButtonValue, rightButtonValue);

            trackball->Poll();
          }
        } else {
          if(buttonsDirty) {
            uint8_t leftButtonValue = left->isPressed();
            uint8_t rightButtonValue = right->isPressed();
            
            mouse_button_send(leftButtonValue, 0, rightButtonValue);

            //NRF_LOG_INFO("Button send: %d:%d - %d, %d", leftButtonValue, rightButtonValue, leftDirty, rightDirty);

            if(left->isLatched() || right->isLatched()) {
              statusIndicator.latchSet();
            } else {
              statusIndicator.latchCleared();
            }
          }

          if (deltaX != 0 || deltaY != 0) {
            mouse_movement_send(deltaX, deltaY);

            //NRF_LOG_INFO("Movement send: %d, %d", deltaX, deltaY);

            trackball->Poll();
          }
        }

        NRF_LOG_FLUSH();
      
        if(!buttonsDirty && deltaX == 0 && deltaY == 0){
          ret_code_t err_code = app_timer_start(m_poll_timer, IDLE_POLL_INTERVAL, trackball);
          APP_ERROR_CHECK(err_code);

          idle_state_handle();
        }

      } else {
        if(!trackball->Poll()) {
          statusIndicator.initializationStarted();
          trackball->Initialize();
        }
      }

      app_sched_execute();
    }
  }
}
